; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob9) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 - pallet
	crate0 crate1 crate2 crate3 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate3)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 distributor0)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 distributor1)
	(clear pallet9)
	(at pallet10 depot0)
	(clear pallet10)
	(at pallet11 depot1)
	(clear pallet11)
	(at pallet12 distributor0)
	(clear crate1)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 287)
	(at truck1 depot1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 353)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 depot2)
	(available hoist9)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(= (weight crate0) 48)
	(at crate1 distributor0)
	(on crate1 pallet12)
	(= (weight crate1) 47)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 81)
	(at crate3 distributor1)
	(on crate3 crate0)
	(= (weight crate3) 42)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet8)
		(on crate1 pallet1)
		(on crate2 crate0)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist3 crate1 pallet12 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist3) (on crate1 pallet12)
   added: (lifting hoist3 crate1) (clear pallet12)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 3
2. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 3
3. (load hoist3 crate1 truck0 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck0) (available hoist3)
   changed: (current_load truck0) from 0 to 47
   goals met: 0 of 3
4. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 3
5. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 47 to 128
   goals met: 0 of 3
6. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 3
7. (unload hoist1 crate1 truck0 depot1)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck0) from 128 to 81
   goals met: 0 of 3
8. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 22 to 32
   goals met: 0 of 3
9. (lift hoist6 crate3 crate0 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist6) (on crate3 crate0)
   added: (lifting hoist6 crate3) (clear crate0)
   changed: (fuel-cost) from 32 to 33
   goals met: 0 of 3
10. (drop hoist1 crate1 pallet1 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at crate1 depot1) (clear crate1) (on crate1 pallet1)
   goals met: 1 of 3
11. (unload hoist4 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist4)
   added: (lifting hoist4 crate2)
   changed: (current_load truck0) from 81 to 0
   goals met: 1 of 3
12. (load hoist6 crate3 truck0 distributor1)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck0) (available hoist6)
   changed: (current_load truck0) from 0 to 42
   goals met: 1 of 3
13. (lift hoist6 crate0 pallet4 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist6) (on crate0 pallet4)
   added: (lifting hoist6 crate0) (clear pallet4)
   changed: (fuel-cost) from 33 to 34
   goals met: 1 of 3
14. (load hoist6 crate0 truck0 distributor1)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck0) (available hoist6)
   changed: (current_load truck0) from 42 to 90
   goals met: 1 of 3
15. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 34 to 44
   goals met: 1 of 3
16. (unload hoist5 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist5)
   added: (lifting hoist5 crate0)
   changed: (current_load truck0) from 90 to 42
   goals met: 1 of 3
17. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 44 to 54
   goals met: 1 of 3
18. (drop hoist5 crate0 pallet8 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet8)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet8)
   goals met: 2 of 3
19. (load hoist4 crate2 truck0 distributor1)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck0) (available hoist4)
   changed: (current_load truck0) from 42 to 123
   goals met: 2 of 3
20. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 54 to 64
   goals met: 2 of 3
21. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   changed: (current_load truck0) from 123 to 42
   goals met: 2 of 3
22. (drop hoist5 crate2 crate0 distributor2)
   deleted: (lifting hoist5 crate2) (clear crate0)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 crate0)
   goals met: 3 of 3
